[
    {
        "name": "Sarah Chen",
        "email": "sarah.chen@gmail.com",
        "title": "Cozy Studio in Manhattan",
        "location": "New York, NY",
        "rentAmount": "1350",
        "roomType": "Own room",
        "preferences": "Non-smoker, No pets, Night owl",
        "contactInfo": "555-0123",
        "availability": "Booked",
        "photo": "https://images.pexels.com/photos/1643383/pexels-photo-1643383.jpeg",
        "details": "Looking for a clean and respectful roommate to share this beautiful Manhattan studio. The space has amazing natural light and is walking distance to Central Park. I work in tech and keep regular hours, so I'd prefer someone who's also professional and tidy. The kitchen is fully equipped and there's a cozy living area perfect for hanging out. Rent includes utilities and high-speed internet. I'm pretty social on weekends but respect quiet time during the week.",
        "likeCount": 0
    },
    {
        "name": "Marcus Johnson",
        "email": "mjohnson22@yahoo.com",
        "title": "Spacious Room in Brooklyn Heights",
        "location": "Brooklyn, NY",
        "rentAmount": "950",
        "roomType": "Single",
        "preferences": "Pet-friendly, Early riser, Non-smoker",
        "contactInfo": "555-0456",
        "availability": "Available",
        "photo": "https://images.pexels.com/photos/1918291/pexels-photo-1918291.jpeg",
        "details": "I'm a 28-year-old graphic designer looking for a chill roommate to share my 2-bedroom apartment in Brooklyn Heights. The room comes unfurnished but has great closet space and gets morning sunlight. I have a friendly golden retriever named Max, so you'd need to be comfortable with pets. I'm an early bird who hits the gym at 6 AM and usually in bed by 10 PM. The apartment has a modern kitchen, in-unit laundry, and a small balcony with city views. Looking for someone who's responsible with rent and enjoys occasional movie nights.",
        "likeCount": 0
    },
    {
        "name": "Jessica Martinez",
        "email": "jess.martinez@outlook.com",
        "title": "Budget-Friendly Room Near Campus",
        "location": "Austin, TX",
        "rentAmount": "650",
        "roomType": "Budget room",
        "preferences": "Student-friendly, Non-smoker, Quiet",
        "contactInfo": "555-0789",
        "availability": "Available",
        "photo": "https://images.pexels.com/photos/1457842/pexels-photo-1457842.jpeg",
        "details": "Perfect for a grad student or young professional! This furnished room is just 10 minutes from UT campus and includes all utilities. I'm a 24-year-old psychology grad student who values a peaceful living environment for studying. The house has a shared kitchen, living room, and two full bathrooms. There's free parking and good public transport connections. I'm looking for someone who's respectful, keeps common areas clean, and won't throw parties. The neighborhood is safe and has great coffee shops within walking distance. Ideal for someone who wants to save money while living comfortably.",
        "likeCount": 0
    },
    {
        "name": "David Kim",
        "email": "dkim.sf@gmail.com",
        "title": "Master Bedroom in Tech Hub",
        "location": "San Francisco, CA",
        "rentAmount": "1800",
        "roomType": "Master",
        "preferences": "Professional, Non-smoker, Tech-savvy",
        "contactInfo": "555-0321",
        "availability": "Booked",
        "photo": "https://images.pexels.com/photos/1571460/pexels-photo-1571460.jpeg",
        "details": "Offering the master bedroom in my 3-bedroom apartment located in SOMA, perfect for tech professionals. The room has an ensuite bathroom, walk-in closet, and stunning city views. I work at a major tech company and travel frequently for work. I'm seeking a like-minded professional who values a clean, modern living space. The apartment features high-end appliances, fiber internet, and a rooftop deck. Common areas include a spacious living room and gourmet kitchen. Looking for someone who's career-focused, maintains their space well, and enjoys the occasional tech meetup or networking event.",
        "likeCount": 0
    },
    {
        "name": "Amanda Rodriguez",
        "email": "amanda.r.chicago@gmail.com",
        "title": "Shared Living in Wicker Park",
        "location": "Chicago, IL",
        "rentAmount": "750",
        "roomType": "Shared",
        "preferences": "Artist-friendly, Smoker-okay, Night owl",
        "contactInfo": "555-0654",
        "availability": "Available",
        "photo": "https://images.pexels.com/photos/1454806/pexels-photo-1454806.jpeg",
        "details": "Creative soul seeking an artistic roommate to share this bohemian loft in trendy Wicker Park! I'm a freelance photographer and painter who loves the vibrant arts scene here. The space has exposed brick walls, high ceilings, and tons of character. You'd be sharing the large bedroom that we can divide with a curtain for privacy. I'm pretty laid-back about smoking and staying up late working on projects. The neighborhood is full of galleries, music venues, and amazing restaurants. Looking for someone who appreciates creativity, doesn't mind a bit of organized chaos, and enjoys deep conversations about art and life.",
        "likeCount": 0
    },
    {
        "name": "Ryan Thompson",
        "email": "rthompson.seattle@yahoo.com",
        "title": "Private Room with City Views",
        "location": "Seattle, WA",
        "rentAmount": "1200",
        "roomType": "Private",
        "preferences": "Coffee lover, Hiking enthusiast, Non-smoker",
        "contactInfo": "555-0987",
        "availability": "Booked",
        "photo": "https://images.pexels.com/photos/1743227/pexels-photo-1743227.jpeg",
        "details": "Offering a private room in my Capitol Hill apartment with separate entrance and stunning views of Elliott Bay. I'm a 30-year-old software engineer who loves exploring Seattle's coffee scene and hiking on weekends. The room has its own mini-fridge and coffee station - perfect for a fellow caffeine enthusiast! I maintain a clean, organized home and appreciate roommates who do the same. The building has a gym and rooftop garden, plus we're walking distance to Pike Place Market. I'm looking for someone who enjoys the Pacific Northwest lifestyle, respects personal space, and maybe wants to join me for weekend adventures in the mountains.",
        "likeCount": 0
    },
    {
        "name": "Lisa Park",
        "email": "lisapark.miami@gmail.com",
        "title": "Beachside Cozy Room",
        "location": "Miami, FL",
        "rentAmount": "900",
        "roomType": "Cozy room",
        "preferences": "Beach lover, Social, Pet-friendly",
        "contactInfo": "555-0135",
        "availability": "Available",
        "photo": "https://images.pexels.com/photos/1329711/pexels-photo-1329711.jpeg",
        "details": "Life's a beach, and so is our apartment! I'm offering a cozy room just two blocks from South Beach in a vibrant Art Deco building. I'm a 26-year-old event coordinator who loves the Miami social scene and spending weekends on the sand. The room gets great ocean breezes and has access to a shared balcony with partial ocean views. I have a small rescue dog named Coco who's super friendly. I'm looking for someone who enjoys beach life, doesn't mind occasional gatherings with friends, and wants to experience the best of Miami nightlife. The area has amazing restaurants, bars, and of course, that famous Miami Beach lifestyle.",
        "likeCount": 0
    },
    {
        "name": "Alex Chen",
        "email": "alexchen.denver@outlook.com",
        "title": "Mountain View Spare Room",
        "location": "Denver, CO",
        "rentAmount": "850",
        "roomType": "Spare room",
        "preferences": "Outdoor enthusiast, 420-friendly, Active lifestyle",
        "contactInfo": "555-0468",
        "availability": "Available",
        "photo": "https://images.pexels.com/photos/1648776/pexels-photo-1648776.jpeg",
        "details": "Adventure awaits in this spare room with incredible mountain views! I'm a 29-year-old outdoor guide who spends most weekends skiing, hiking, or mountain biking. The room is unfurnished but spacious with large windows showcasing the Rocky Mountains. I keep a pretty relaxed household - 420 friendly and always down for spontaneous adventures. The house has a mudroom for all our gear, a hot tub for post-adventure recovery, and easy access to hiking trails. I'm seeking an active roommate who shares my passion for Colorado's outdoor lifestyle, keeps things chill, and maybe wants a skiing or hiking buddy. Bonus points if you have your own outdoor gear!",
        "likeCount": 0
    },
    {
        "name": "Taylor Williams",
        "email": "twilliams.portland@gmail.com",
        "title": "Furnished Room in Pearl District",
        "location": "Portland, OR",
        "rentAmount": "1100",
        "roomType": "Furnished",
        "preferences": "Foodie, Eco-conscious, Bike-friendly",
        "contactInfo": "555-0791",
        "availability": "Booked",
        "photo": "https://images.pexels.com/photos/1457843/pexels-photo-1457843.jpeg",
        "details": "Keep Portland weird! Offering a fully furnished room in the trendy Pearl District, perfect for someone relocating to our amazing city. I'm a 27-year-old chef who works at a farm-to-table restaurant and loves exploring Portland's incredible food scene. The room comes with a comfortable bed, desk, dresser, and everything you need to settle in immediately. I'm eco-conscious and bike everywhere - there's secure bike storage in the building. I compost, buy local, and try to live sustainably. Looking for a like-minded roommate who appreciates good food, supports local businesses, and wants to explore Portland's unique neighborhoods. The building is LEED certified and we're walking distance to food trucks, breweries, and the Saturday Market.",
        "likeCount": 0
    },
    {
        "name": "Jordan Davis",
        "email": "jdavis.nashville@yahoo.com",
        "title": "Music City Nice Room",
        "location": "Nashville, TN",
        "rentAmount": "700",
        "roomType": "Nice room",
        "preferences": "Music lover, Social drinker, Night owl",
        "contactInfo": "555-0246",
        "availability": "Available",
        "photo": "https://images.pexels.com/photos/1080721/pexels-photo-1080721.jpeg",
        "details": "Y'all ready for some Nashville living? I'm offering a nice room in my house just 15 minutes from Broadway and all the honky-tonks! I'm a 25-year-old session musician who plays guitar and loves the local music scene. The room has hardwood floors, good acoustics (perfect if you play music too), and plenty of natural light. I often have musician friends over for jam sessions and enjoy checking out live shows around town. The house has a front porch perfect for morning coffee and evening beers. I'm looking for someone who appreciates live music, doesn't mind the occasional late-night creativity session, and wants to experience authentic Nashville culture. Music industry connections are a bonus but not required!",
        "likeCount": 0
    },
    {
        "name": "Maya Patel",
        "email": "maya.patel.boston@gmail.com",
        "title": "Student-Friendly Clean Room",
        "location": "Boston, MA",
        "rentAmount": "800",
        "roomType": "Clean room",
        "preferences": "Student-friendly, Non-smoker, Study-focused",
        "contactInfo": "555-0813",
        "availability": "Booked",
        "photo": "https://images.pexels.com/photos/1595385/pexels-photo-1595385.jpeg",
        "details": "Perfect for a serious student or young professional! This clean, organized room is located near several universities and has excellent public transportation access. I'm a 23-year-old medical student who maintains a quiet, study-focused environment. The room has a large desk area, good lighting for reading, and built-in shelving for books. I keep common areas spotless and expect the same from roommates. The apartment has high-speed internet, a well-equipped kitchen, and a comfortable study nook in the living room. I'm looking for someone who's academically driven, respects quiet hours during exam periods, and takes pride in maintaining a clean living space. Library study groups and coffee shop hangouts are definitely encouraged!",
        "likeCount": 0
    },
    {
        "name": "Carlos Mendoza",
        "email": "carlos.m.phoenix@outlook.com",
        "title": "Desert Oasis Quiet Room",
        "location": "Phoenix, AZ",
        "rentAmount": "600",
        "roomType": "Quiet room",
        "preferences": "Heat-tolerant, Pool lover, Early riser",
        "contactInfo": "555-0579",
        "availability": "Available",
        "photo": "https://images.pexels.com/photos/1571461/pexels-photo-1571461.jpeg",
        "details": "Escape to desert tranquility in this quiet room with access to a beautiful backyard pool! I'm a 31-year-old yoga instructor who loves the peaceful Arizona lifestyle and early morning desert hikes. The room has tile floors to stay cool, blackout curtains for afternoon naps, and a ceiling fan for comfort. Our backyard is an oasis with a pool, hot tub, and desert landscaping perfect for meditation or reading. I maintain a calm, zen-like atmosphere and practice morning yoga by the pool. Looking for someone who appreciates quiet living, enjoys swimming and desert sunsets, and can handle our beautiful but intense Arizona heat. The neighborhood is safe and friendly, with great hiking trails just minutes away.",
        "likeCount": 0
    },
    {
        "name": "S M Maksudur Rahman",
        "email": "code.meshams@gmail.com",
        "title": "Modern Apartment in Downtown",
        "location": "Atlanta, GA",
        "rentAmount": "950",
        "roomType": "Single",
        "preferences": "Tech-friendly, Non-smoker, Professional",
        "contactInfo": "555-0642",
        "availability": "Available",
        "photo": "https://images.pexels.com/photos/1571468/pexels-photo-1571468.jpeg",
        "details": "I'm a software developer looking for a professional roommate to share my modern 2-bedroom apartment in downtown Atlanta. The room is spacious with large windows and gets excellent natural light throughout the day. I work remotely most days and maintain a quiet, focused environment perfect for other professionals or students. The apartment features high-speed fiber internet, modern appliances, and is within walking distance of MARTA stations. I'm seeking someone who's career-oriented, keeps shared spaces clean, and respects work-from-home schedules. The building has a gym, rooftop terrace, and 24/7 security. Great location near tech companies, restaurants, and entertainment districts.",
        "likeCount": 0
    },
    {
        "name": "S M Maksudur Rahman",
        "email": "code.meshams@gmail.com",
        "title": "Spacious Room Near University",
        "location": "Dallas, TX",
        "rentAmount": "750",
        "roomType": "Own room",
        "preferences": "Student-friendly, Quiet, Non-smoker",
        "contactInfo": "555-0897",
        "availability": "Available",
        "photo": "https://images.pexels.com/photos/1648771/pexels-photo-1648771.jpeg",
        "details": "Offering a comfortable room in my house located just 15 minutes from major universities in Dallas. I'm a graduate student in computer science who values a peaceful study environment. The room comes with a built-in desk, good lighting for reading, and plenty of storage space. I maintain a quiet household that's perfect for studying and focusing on academic work. The house has high-speed internet, a shared study area, and a well-equipped kitchen. I'm looking for a fellow student or young professional who's serious about their studies, keeps things organized, and enjoys occasional discussions about technology and programming. The neighborhood is safe with good public transportation and several coffee shops nearby for study sessions.",
        "likeCount": 0
    }
]